app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"  ORDER BY last_name, birthday DESC
---
  def index
    @artists = Artist.order('last_name').all