app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT "movies".* FROM "movies"  ORDER BY title ASC

  def create
    puts movie_params
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "year", "director_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Titanic"], ["year", 1997], ["director_id", 5], ["created_at", "2016-04-11 04:11:12 UTC"], ["updated_at", "2016-04-11 04:11:12 UTC"]]

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Terminator 5"], ["updated_at", "2016-04-10 06:41:33.756163"], ["id", 1]]